# Handling Missing Data

> For numeric data,pandas uses the floating-point value NaN(Not a number) to represent missing data.

In [115]:
import numpy as np
import pandas as pd

In [116]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [117]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [118]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [119]:
string_data[0] = None

In [120]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

> Filter out Missing Data

In [121]:
from numpy import nan as NA

In [122]:
data = pd.Series([1,NA,3.5,NA,7])

In [123]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [124]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [125]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [126]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                    [NA,NA,NA],[NA,6.5,3.]])

In [127]:
cleaned = data.dropna()

In [128]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [129]:
data.dropna(how='all') #how='all' will drop rows that are all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [130]:
data[4] = NA

In [131]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [132]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [133]:
df = pd.DataFrame(np.random.randn(7,3))

In [134]:
df.iloc[:4,1] = NA

In [135]:
df.iloc[:2,2] = NA

In [136]:
df

          0         1         2
0  0.280506       NaN       NaN
1  1.552480       NaN       NaN
2  1.046715       NaN  0.924381
3  0.198344       NaN -0.007159
4  0.440584  0.781660 -0.672590
5  0.073573 -0.804284 -0.943244
6  1.896922  0.914766 -1.181374

In [137]:
df.dropna()

          0         1         2
4  0.440584  0.781660 -0.672590
5  0.073573 -0.804284 -0.943244
6  1.896922  0.914766 -1.181374

In [138]:
df.dropna(thresh=2)

          0         1         2
2  1.046715       NaN  0.924381
3  0.198344       NaN -0.007159
4  0.440584  0.781660 -0.672590
5  0.073573 -0.804284 -0.943244
6  1.896922  0.914766 -1.181374

> Filling Missing Data

In [139]:
data.fillna(0)

     0    1    2    4
0  1.0  6.5  3.0  0.0
1  1.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  6.5  3.0  0.0

In [140]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.280506  0.500000  0.000000
1  1.552480  0.500000  0.000000
2  1.046715  0.500000  0.924381
3  0.198344  0.500000 -0.007159
4  0.440584  0.781660 -0.672590
5  0.073573 -0.804284 -0.943244
6  1.896922  0.914766 -1.181374

In [141]:
df.fillna({1:0,2:0})

          0         1         2
0  0.280506  0.000000  0.000000
1  1.552480  0.000000  0.000000
2  1.046715  0.000000  0.924381
3  0.198344  0.000000 -0.007159
4  0.440584  0.781660 -0.672590
5  0.073573 -0.804284 -0.943244
6  1.896922  0.914766 -1.181374

In [142]:
_ = df.fillna(0,inplace=True) #fillna returns a new object,but you can modify the existing object in-place.

In [143]:
df

          0         1         2
0  0.280506  0.000000  0.000000
1  1.552480  0.000000  0.000000
2  1.046715  0.000000  0.924381
3  0.198344  0.000000 -0.007159
4  0.440584  0.781660 -0.672590
5  0.073573 -0.804284 -0.943244
6  1.896922  0.914766 -1.181374

In [144]:
df = pd.DataFrame(np.random.randn(6,3))

In [145]:
df.iloc[2:,1] =NA

In [146]:
df.iloc[4:,2] = NA

In [147]:
df

          0         1         2
0 -0.922411  1.122043 -0.905717
1  0.125352  2.609596 -0.322265
2 -0.766266       NaN -1.302297
3  0.729891       NaN  0.018673
4 -0.464038       NaN       NaN
5 -0.287281       NaN       NaN

In [148]:
df.fillna(method='ffill')

          0         1         2
0 -0.922411  1.122043 -0.905717
1  0.125352  2.609596 -0.322265
2 -0.766266  2.609596 -1.302297
3  0.729891  2.609596  0.018673
4 -0.464038  2.609596  0.018673
5 -0.287281  2.609596  0.018673

In [149]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.922411  1.122043 -0.905717
1  0.125352  2.609596 -0.322265
2 -0.766266  2.609596 -1.302297
3  0.729891  2.609596  0.018673
4 -0.464038       NaN  0.018673
5 -0.287281       NaN  0.018673

In [150]:
data = pd.Series([1.,NA,3.5,NA,7])

# Data Transformation

>Removing Duplicates

In [151]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],
                    'k2':[1,1,2,3,3,4,4]})

In [152]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [153]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [154]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [155]:
data['v1'] = range(7)

In [156]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [157]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

> Transforming Data using a Function or Mapping

In [158]:
data = pd.DataFrame({'food':['bacon','pulled fork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [159]:
data

          food  ounces
0        bacon     4.0
1  pulled fork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [160]:
meat_to_animal = {'bacon':'pig',
                 'pulled pork' : 'pig',
                 'pastrami' : 'cow',
                 'corned beef' : 'cow',
                 'honey ham' : 'pig',
                 'nova lox' : 'salmon'}

In [161]:
lowercased = data['food'].str.lower()

In [162]:
lowercased

0          bacon
1    pulled fork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [163]:
data['animal'] = lowercased.map(meat_to_animal)

In [164]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled fork     3.0     NaN
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [165]:
data['food'].map(lambda x : meat_to_animal[x.lower()])

KeyError: 'pulled fork'

> Replacing Values

In [166]:
data = pd.Series([1.,-999.,2.,999.,-1000.,3.])

In [167]:
data

0       1.0
1    -999.0
2       2.0
3     999.0
4   -1000.0
5       3.0
dtype: float64

In [168]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3     999.0
4   -1000.0
5       3.0
dtype: float64

In [169]:
data.replace([-999,1000],np.nan)

0       1.0
1       NaN
2       2.0
3     999.0
4   -1000.0
5       3.0
dtype: float64

In [170]:
data.replace([-999,-1000],[np.nan,0])

0      1.0
1      NaN
2      2.0
3    999.0
4      0.0
5      3.0
dtype: float64

In [171]:
data.replace([-999,-1000],[np.nan,0])

0      1.0
1      NaN
2      2.0
3    999.0
4      0.0
5      3.0
dtype: float64

In [172]:
data.replace({-999:np.nan,-1000:0})

0      1.0
1      NaN
2      2.0
3    999.0
4      0.0
5      3.0
dtype: float64

> Renaming Axis Indexes

In [173]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio','Colorado','New York'],
                   columns = ['one','two','three','four'])

In [174]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [175]:
transform = lambda x : x[:4].upper()

In [178]:
data.index = data.index.map(transform)

In [179]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [182]:
data.rename(index = {'Ohio':'Indiana'},
           columns={'three':'peekaboo'})

      one  two  peekaboo  four
OHIO    0    1         2     3
COLO    4    5         6     7
NEW     8    9        10    11

In [183]:
data.rename(index= {'Ohio':'Indiana'},inplace=True)

In [184]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

> Discretization and Binning

In [185]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [186]:
bins = [18,25,35,60,100]

In [187]:
cats = pd.cut(ages,bins)

In [188]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [189]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [190]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [191]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [192]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [193]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [194]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [195]:
data = np.random.rand(20)

In [196]:
data

array([0.50484062, 0.09780009, 0.14640314, 0.58598751, 0.55366696,
       0.55929313, 0.6428238 , 0.36196175, 0.59758883, 0.82639368,
       0.26748558, 0.73421576, 0.75134713, 0.57007262, 0.71282606,
       0.91030748, 0.9910206 , 0.24687702, 0.68305201, 0.35472043])

In [197]:
pd.cut(data,4,precision=2)

[(0.32, 0.54], (0.097, 0.32], (0.097, 0.32], (0.54, 0.77], (0.54, 0.77], ..., (0.77, 0.99], (0.77, 0.99], (0.097, 0.32], (0.54, 0.77], (0.32, 0.54]]
Length: 20
Categories (4, interval[float64]): [(0.097, 0.32] < (0.32, 0.54] < (0.54, 0.77] < (0.77, 0.99]]

In [198]:
data = np.random.randn(1000)

In [199]:
cats = pd.qcut(data,4)

In [200]:
cats

[(-0.679, -0.00835], (-3.5309999999999997, -0.679], (-0.679, -0.00835], (0.683, 3.623], (-3.5309999999999997, -0.679], ..., (0.683, 3.623], (-0.00835, 0.683], (-0.679, -0.00835], (-3.5309999999999997, -0.679], (0.683, 3.623]]
Length: 1000
Categories (4, interval[float64]): [(-3.5309999999999997, -0.679] < (-0.679, -0.00835] < (-0.00835, 0.683] < (0.683, 3.623]]

In [201]:
pd.value_counts(cats)

(0.683, 3.623]                   250
(-0.00835, 0.683]                250
(-0.679, -0.00835]               250
(-3.5309999999999997, -0.679]    250
dtype: int64

In [203]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.296, -0.00835], (-3.5309999999999997, -1.296], (-1.296, -0.00835], (-0.00835, 1.213], (-1.296, -0.00835], ..., (1.213, 3.623], (-0.00835, 1.213], (-1.296, -0.00835], (-3.5309999999999997, -1.296], (1.213, 3.623]]
Length: 1000
Categories (4, interval[float64]): [(-3.5309999999999997, -1.296] < (-1.296, -0.00835] < (-0.00835, 1.213] < (1.213, 3.623]]

> Detecting and Filtering Outliers

In [204]:
data = pd.DataFrame(np.random.randn(1000,4))

In [206]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.029048     0.045053     0.012847     0.033853
std       1.053697     0.994569     0.993859     1.031792
min      -3.330134    -3.325608    -3.878290    -3.431633
25%      -0.689444    -0.589647    -0.661159    -0.716192
50%       0.057907     0.064850     0.027619     0.038634
75%       0.783130     0.710752     0.654187     0.753321
max       2.978185     3.260864     3.600636     3.864901

In [207]:
col = data[2]

In [208]:
col

0     -1.201544
1     -0.058148
2     -1.211036
3     -0.329675
4     -0.191492
         ...
995   -0.650546
996    1.498090
997    0.656662
998   -0.662582
999   -0.687465
Name: 2, Length: 1000, dtype: float64

In [209]:
col[np.abs(col)>3]

221   -3.032981
358   -3.878290
975    3.600636
Name: 2, dtype: float64

In [210]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
7   -3.330134  0.619731 -0.176483  0.066614
221  0.384998 -0.795439 -3.032981 -1.812671
358  0.454529 -0.025506 -3.878290 -0.073485
404 -0.960531 -3.325608 -0.738645 -0.284723
528  2.086219  1.052574 -0.455732  3.864901
572  1.014958  0.252517  0.387563 -3.431633
943  1.428925  3.260864  2.088389  0.311062
975 -1.065994  0.192372  3.600636 -1.230750

In [211]:
data[np.abs(data)>3] = np.sign(data)*3

In [212]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.029378     0.045118     0.013158     0.033419
std       1.052694     0.992706     0.988703     1.027570
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.689444    -0.589647    -0.661159    -0.716192
50%       0.057907     0.064850     0.027619     0.038634
75%       0.783130     0.710752     0.654187     0.753321
max       2.978185     3.000000     3.000000     3.000000

In [214]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1  1.0 -1.0 -1.0  1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0  1.0 -1.0  1.0

> Permutation and Random Sampling

In [215]:
df = pd.DataFrame(np.arange(5*4).reshape(5,4))

In [216]:
sampler = np.random.permutation(5)

In [217]:
sampler

array([1, 3, 2, 0, 4])

In [218]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [219]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [220]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

In [221]:
choice = pd.Series([5,7,-1,6,4])

In [222]:
draws = choice.sample(n=10,replace=True)

In [223]:
draws

3    6
1    7
4    4
0    5
1    7
0    5
4    4
0    5
2   -1
0    5
dtype: int64

> Computing Indicator/Dummy Variables

In [224]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1':range(6)})

In [225]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [226]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [227]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [228]:
df_with_dummy = df[['data1']].join(dummies)

In [229]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

# String Manipulation

> String Object Methods

In [231]:
val = 'a,b,guido'

In [233]:
val.split(',') #split is often combined with strip to trim whitespace

['a', 'b', 'guido']

In [234]:
pieces = [x.strip() for x in val.split(',')]

In [235]:
pieces

['a', 'b', 'guido']

In [236]:
first,second,third = pieces

In [237]:
first + '::' + second + '::' + third

'a::b::guido'

In [239]:
'guido' in val

True

In [240]:
val.index(',')

1

In [241]:
val.find(':')

-1

In [242]:
val.index(':')

ValueError: substring not found

In [243]:
val.count(',')

2

In [244]:
val.replace(',','::')

'a::b::guido'

In [247]:
val.replace(',', '')

'abguido'

> Regular Expressions

In [249]:
import re

In [250]:
text = "foo   bar\t baz   \tqux"

In [252]:
re.split('\s+' ,text)

['foo', 'bar', 'baz', 'qux']

In [253]:
regex = re.compile('\s+')

In [254]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [255]:
regex.findall(text)

['   ', '\t ', '   \t']

In [257]:
text = """Dave dave@gmail.com Steve steve@yahoo.com Rob rob@gmail.com Ryan ryan@yahoo.in"""

In [259]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [260]:
regex = re.compile(pattern,flags=re.IGNORECASE)

In [261]:
regex.findall(text)

['dave@gmail.com', 'steve@yahoo.com', 'rob@gmail.com', 'ryan@yahoo.in']

In [262]:
m = regex.search(text)

In [263]:
m

In [264]:
text[m.start() : m.end()]

'dave@gmail.com'

In [265]:
print(regex.match(text))

None

In [266]:
print(regex.sub('Redacted',text))

Dave Redacted Steve Redacted Rob Redacted Ryan Redacted

In [270]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [271]:
regex = re.compile(pattern,flags=re.IGNORECASE)

In [272]:
m = regex.match('wesm@bright.net')

In [273]:
m.groups()

('wesm', 'bright', 'net')

In [274]:
regex.findall(text)

[('dave', 'gmail', 'com'),
 ('steve', 'yahoo', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'in')]

In [275]:
print(regex.sub(r'Username: \1,Domain: \2,Suffix: \3',text))

Dave Username: dave,Domain: gmail,Suffix: com Steve Username: steve,Domain: yahoo,Suffix: com Rob Username: rob,Domain: gmail,Suffix: com Ryan Username: ryan,Domain: yahoo,Suffix: in

>Vectorized String Functions in pandas

In [279]:
data = {'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}

In [282]:
data = pd.Series(data)

In [283]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [284]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [286]:
pattern= r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [287]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [288]:
matches = data.str.findall(pattern,flags=re.IGNORECASE).str[0]

In [289]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [290]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [291]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [292]:
data.str.extract(pattern,flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN